hello_variants = [
  "Здравствуйте. Пару секунд и я отвечу...\n",
  "Однако приветсвую. Ответ вот-вот будет дан...\n",
  "Доброго времени суток. Ваш ответ:\n",
  "Алоха. Ответ таков:\n",
]

puts hello_variants.sample

sleep(2)

answers = [
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",

  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",

  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",

  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
]

puts answers.sample
puts
